---
kind: method
id: M:Autodesk.Revit.DB.RevisionNumberingSequence.HasValidNumericRevisionSettings
source: html/4592ebc9-6662-6da7-0a59-0b038b60ef23.htm
---
# Autodesk.Revit.DB.RevisionNumberingSequence.HasValidNumericRevisionSettings Method

Checks whether the revision numbering sequence owns a valid numeric revision settings.

## Syntax (C#)
```csharp
public bool HasValidNumericRevisionSettings()
```

## Returns
True if the revision numbering sequence owns a valid numeric revision settings.